DataProcessors/ОбменЧерезФайлыDBF.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбменЧерезФайлыDBF</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/ЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказПокупателя</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Денежный</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Денежный</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ОбменЧерезФайлыDBF/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБЪЕКТ "XBASE"

&НаСервере
Процедура Выгрузить()
	
	ОбъектXBase = Новый XBase;
	ОбъектXBase.Кодировка = КодировкаXBase.ANSI; // Windows
	
	// Описание структуры таблицы
	ОбъектXBase.поля.Добавить("NUMBER", "S", 4); // Строка
	ОбъектXBase.поля.Добавить("DATE", "D"); // Дата
	ОбъектXBase.поля.Добавить("CUSTOMER", "S", 25); // Строка
	ОбъектXBase.поля.Добавить("PERSON", "S", 50); // Строка
	ОбъектXBase.поля.Добавить("TOTALSUM", "N", 15, 2); // Число
	ОбъектXBase.поля.Добавить("DELETEMARK", "L"); // Булево
	
	// Создание файла
	ОбъектXBase.СоздатьФайл(ТекущийКаталог + "Orders.dbf");
	
	Выборка = Документы.ЗаказПокупателя.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбъектXBase.Добавить(); // Строку
		
		ОбъектXBase.NUMBER = Выборка.Номер;
		ОбъектXBase.DATE = Выборка.Дата;
		ОбъектXBase.CUSTOMER = Выборка.Покупатель;
		ОбъектXBase.PERSON = Выборка.КонтактноеЛицо;
		ОбъектXBase.TOTALSUM = Выборка.СуммаПоДокументу;
		ОбъектXBase.DELETEMARK = Выборка.ПометкаУдаления;
		
		ОбъектXBase.Записать();
		
	КонецЦикла;	
	
	ОбъектXBase.ЗакрытьФайл();
	
	Сообщения.ДобавитьСтроку("Выгрузка данных завершена, перейдите в текущий каталог!");		
	
КонецПроцедуры

&НаСервере
Процедура Прочитать()
	
	ОбъектXBase = Новый XBase(ТекущийКаталог + "Orders.dbf");
	ОбъектXBase.Кодировка = КодировкаXBase.ANSI; // Windows
	
	// Данные 1-й строки
	СтрокаXBase(ОбъектXBase);
	
	// Начиная со 2-й строки
	Пока ОбъектXBase.Следующая() Цикл
		
		// Данные очередной строки
		СтрокаXBase(ОбъектXBase);
		
	КонецЦикла;	
	
	ОбъектXBase.ЗакрытьФайл();
	
КонецПроцедуры

&НаСервере
Процедура СтрокаXBase(ОбъектXBase)
	
	Номер = ОбъектXBase.NUMBER;
	Дата = ОбъектXBase.DATE;
	Покупатель = ОбъектXBase.CUSTOMER;
	КонтактноеЛицо = ОбъектXBase.PERSON;
	СуммаПоДокументу = ОбъектXBase.TOTALSUM;
	ПометкаУдаления = ОбъектXBase.DELETEMARK;
	
	Сообщения.ДобавитьСтроку("Номер: " + Номер + "
	|Дата: " + Дата + "
	|Покупатель: " + Покупатель + "
	|Контактное лицо: " + КонтактноеЛицо + "
	|Сумма по документу: " + СуммаПоДокументу + "
	|Пометка удаления: " + Булево(ПометкаУдаления) + Символы.ПС);
	
КонецПроцедуры	

&НаСервере
Процедура Удалить()
	
	ОбъектXBase = Новый XBase(ТекущийКаталог + "Orders.dbf");
	ОбъектXBase.Кодировка = КодировкаXBase.ANSI; // Windows
	
	ОбъектXBase.Первая();
	
	Пока НЕ ОбъектXBase.ВКонце() Цикл
		
		// Данные очередной строки
		Если ОбъектXBase.TOTALSUM < 15000 Тогда
			ОбъектXBase.Удалить();
		КонецЕсли;	
		ОбъектXBase.Следующая();
		
	КонецЦикла;	
	
	ОбъектXBase.ЗакрытьФайл();
	
	Сообщения.ДобавитьСтроку("Удаление данных завершено, перейдите в текущий каталог!");			
	
КонецПроцедуры



#Область ПРОЧЕЕ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийКаталог = 
	ОбщегоНазначения_Сервер.ПолучитьЗначениеКонстанты("ОсновнойКаталог") + "Вебинар 1\Обмен через dbf-файлы\";
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийКаталогНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ТекущийКаталог);
	
КонецПроцедуры


&НаКлиенте
Процедура Команда_Выгрузить(Команда)
	
	Сообщения.Очистить();
	Выгрузить();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_Прочитать(Команда)
	
	Сообщения.Очистить();
	Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_УдалитьМеньше15000(Команда)
	
	Сообщения.Очистить();
	Удалить();
	
КонецПроцедуры

#КонецОбласти
